//
//  Text.swift
//  Grind
//
//  Created by 최형민 on 2022/09/20.
//

import Foundation

extension Constants {
    
    enum Text {
        static let walkThroughWelcomeText = """
                      운동하는 당신을 응원합니다:)
                      
                      외롭고 힘든 헬스라는 길
                      Grind와 함께 정진하시죠!!!
                      
                      헬린이가 만든 앱이라 과학적 근거가 부족한 요소들이 많지만
                      스스로 벌크업/다이어트를 진행하며 필수적으로 필요한 것들을 포함했습니다!
                      
                      당신의 체중을 입력해주세요!
                      """
        
        static let walkThroughTextField = "kg 기준, 예: 71.0"
        
        static let adviceMessage = ["운동은 주 7일!!", "혹시 오늘 운동하셨나요? 득근하러 가셔야죠", "섭취칼로리를 정하기 전에 유지 칼로리부터 찾아서 본인의 상황에 맞는 칼로리를 섭취하세요", "벌크업 중이면 잉여칼로리를 본인에게 맞게 최대한 많이 다이어트 중이면 최대한 낮게 유지하는 걸 추천드립니다", "다이어트를 진행하실 때 주당 최대 0.5~0.7kg 내로 감량하시길 추천드립니다, 그 이상은 근손실이 발생할 수 있으니..!", "해당 앱의 버그를 발견하시면 개발자에게 제보해주시길 부탁드립니다!"]
    }
}
